7767517
516 644
Input                    in0                      0 1 in0
Convolution              0                        1 1 in0 1 0=16 1=3 3=2 4=1 5=1 6=432
Split                    splitncnn_0              1 6 1 2 3 4 5 6 7
BatchNorm                8                        1 1 7 9 0=16
BinaryOp                 10                       1 1 9 11 1=1
ConvolutionDepthWise     12                       1 1 6 13 0=16 1=1 5=1 6=16 7=16
BinaryOp                 14                       2 1 11 13 15
ConvolutionDepthWise     16                       1 1 5 17 0=16 1=3 4=1 5=1 6=144 7=16
BinaryOp                 18                       2 1 15 17 19
ConvolutionDepthWise     20                       1 1 4 21 0=16 1=3 4=1 5=1 6=144 7=16
BinaryOp                 22                       2 1 19 21 23
ConvolutionDepthWise     24                       1 1 3 25 0=16 1=3 4=1 5=1 6=144 7=16
BinaryOp                 26                       2 1 23 25 27
ConvolutionDepthWise     28                       1 1 2 29 0=16 1=3 4=1 5=1 6=144 7=16
BinaryOp                 30                       2 1 27 29 31
BinaryOp                 32                       1 1 31 33 0=2 1=1 2=1.384107e+00
BinaryOp                 34                       1 1 33 35 1=1 2=5.860772e-01
HardSwish                36                       1 1 35 37 0=1.666667e-01
BinaryOp                 38                       1 1 37 39 0=2 1=1 2=1.675188e-01
BinaryOp                 40                       1 1 39 41 1=1 2=3.470043e-05
Split                    splitncnn_1              1 4 41 42 43 44 45
Convolution              46                       1 1 45 47 0=32 1=1 5=1 6=512
BinaryOp                 48                       1 1 47 49 1=1
Convolution              50                       1 1 44 51 0=32 1=1 5=1 6=512
BinaryOp                 52                       2 1 49 51 53
Convolution              54                       1 1 43 55 0=32 1=1 5=1 6=512
BinaryOp                 56                       2 1 53 55 57
Convolution              58                       1 1 42 59 0=32 1=1 5=1 6=512
BinaryOp                 60                       2 1 57 59 61
BinaryOp                 62                       1 1 61 63 0=2 1=1 2=2.111558e+00
BinaryOp                 64                       1 1 63 65 1=1 2=1.056320e+00
HardSwish                66                       1 1 65 67 0=1.666667e-01
BinaryOp                 68                       1 1 67 69 0=2 1=1 2=1.828085e-01
BinaryOp                 70                       1 1 69 71 1=1 2=-2.008548e-01
Split                    splitncnn_2              1 6 71 72 73 74 75 76 77
BatchNorm                78                       1 1 77 79 0=32
BinaryOp                 80                       1 1 79 81 1=1
ConvolutionDepthWise     82                       1 1 76 83 0=32 1=1 5=1 6=32 7=32
BinaryOp                 84                       2 1 81 83 85
ConvolutionDepthWise     86                       1 1 75 87 0=32 1=3 4=1 5=1 6=288 7=32
BinaryOp                 88                       2 1 85 87 89
ConvolutionDepthWise     90                       1 1 74 91 0=32 1=3 4=1 5=1 6=288 7=32
BinaryOp                 92                       2 1 89 91 93
ConvolutionDepthWise     94                       1 1 73 95 0=32 1=3 4=1 5=1 6=288 7=32
BinaryOp                 96                       2 1 93 95 97
ConvolutionDepthWise     98                       1 1 72 99 0=32 1=3 4=1 5=1 6=288 7=32
BinaryOp                 100                      2 1 97 99 101
BinaryOp                 102                      1 1 101 103 0=2 1=1 2=2.166723e+00
BinaryOp                 104                      1 1 103 105 1=1 2=1.000862e+00
HardSwish                106                      1 1 105 107 0=1.666667e-01
BinaryOp                 108                      1 1 107 109 0=2 1=1 2=6.063076e-02
BinaryOp                 110                      1 1 109 111 1=1 2=-4.069060e-05
Split                    splitncnn_3              1 4 111 112 113 114 115
Convolution              116                      1 1 115 117 0=64 1=1 5=1 6=2048
BinaryOp                 118                      1 1 117 119 1=1
Convolution              120                      1 1 114 121 0=64 1=1 5=1 6=2048
BinaryOp                 122                      2 1 119 121 123
Convolution              124                      1 1 113 125 0=64 1=1 5=1 6=2048
BinaryOp                 126                      2 1 123 125 127
Convolution              128                      1 1 112 129 0=64 1=1 5=1 6=2048
BinaryOp                 130                      2 1 127 129 131
BinaryOp                 132                      1 1 131 133 0=2 1=1 2=2.172230e+00
BinaryOp                 134                      1 1 133 135 1=1 2=8.583514e-01
HardSwish                136                      1 1 135 137 0=1.666667e-01
BinaryOp                 138                      1 1 137 139 0=2 1=1 2=4.061948e-01
BinaryOp                 140                      1 1 139 141 1=1 2=-2.785621e-01
Split                    splitncnn_4              1 6 141 142 143 144 145 146 147
BatchNorm                148                      1 1 147 149 0=64
BinaryOp                 150                      1 1 149 151 1=1
ConvolutionDepthWise     152                      1 1 146 153 0=64 1=1 5=1 6=64 7=64
BinaryOp                 154                      2 1 151 153 155
ConvolutionDepthWise     156                      1 1 145 157 0=64 1=3 4=1 5=1 6=576 7=64
BinaryOp                 158                      2 1 155 157 159
ConvolutionDepthWise     160                      1 1 144 161 0=64 1=3 4=1 5=1 6=576 7=64
BinaryOp                 162                      2 1 159 161 163
ConvolutionDepthWise     164                      1 1 143 165 0=64 1=3 4=1 5=1 6=576 7=64
BinaryOp                 166                      2 1 163 165 167
ConvolutionDepthWise     168                      1 1 142 169 0=64 1=3 4=1 5=1 6=576 7=64
BinaryOp                 170                      2 1 167 169 171
BinaryOp                 172                      1 1 171 173 0=2 1=1 2=3.069615e+00
BinaryOp                 174                      1 1 173 175 1=1 2=3.243599e-01
HardSwish                176                      1 1 175 177 0=1.666667e-01
BinaryOp                 178                      1 1 177 179 0=2 1=1 2=3.095054e-02
BinaryOp                 180                      1 1 179 181 1=1 2=-4.651240e-05
Split                    splitncnn_5              1 5 181 182 183 184 185 186
BatchNorm                187                      1 1 186 188 0=64
BinaryOp                 189                      1 1 188 190 1=1
Convolution              191                      1 1 185 192 0=64 1=1 5=1 6=4096
BinaryOp                 193                      2 1 190 192 194
Convolution              195                      1 1 184 196 0=64 1=1 5=1 6=4096
BinaryOp                 197                      2 1 194 196 198
Convolution              199                      1 1 183 200 0=64 1=1 5=1 6=4096
BinaryOp                 201                      2 1 198 200 202
Convolution              203                      1 1 182 204 0=64 1=1 5=1 6=4096
BinaryOp                 205                      2 1 202 204 206
BinaryOp                 207                      1 1 206 208 0=2 1=1 2=2.164231e+00
BinaryOp                 209                      1 1 208 210 1=1 2=4.336767e-01
HardSwish                211                      1 1 210 212 0=1.666667e-01
BinaryOp                 213                      1 1 212 214 0=2 1=1 2=4.283067e-01
BinaryOp                 215                      1 1 214 216 1=1 2=-8.378658e-02
Split                    splitncnn_6              1 5 216 217 218 219 220 221
ConvolutionDepthWise     222                      1 1 221 223 0=64 1=1 13=2 5=1 6=64 7=64
BinaryOp                 224                      1 1 223 225 1=1
ConvolutionDepthWise     226                      1 1 220 227 0=64 1=3 13=2 4=1 5=1 6=576 7=64
BinaryOp                 228                      2 1 225 227 229
ConvolutionDepthWise     230                      1 1 219 231 0=64 1=3 13=2 4=1 5=1 6=576 7=64
BinaryOp                 232                      2 1 229 231 233
ConvolutionDepthWise     234                      1 1 218 235 0=64 1=3 13=2 4=1 5=1 6=576 7=64
BinaryOp                 236                      2 1 233 235 237
ConvolutionDepthWise     238                      1 1 217 239 0=64 1=3 13=2 4=1 5=1 6=576 7=64
BinaryOp                 240                      2 1 237 239 241
BinaryOp                 242                      1 1 241 243 0=2 1=1 2=2.293733e+00
BinaryOp                 244                      1 1 243 245 1=1 2=1.019056e+00
HardSwish                246                      1 1 245 247 0=1.666667e-01
BinaryOp                 248                      1 1 247 249 0=2 1=1 2=3.271981e-02
BinaryOp                 250                      1 1 249 251 1=1 2=-2.652152e-06
Split                    splitncnn_7              1 4 251 252 253 254 255
Convolution              256                      1 1 255 257 0=128 1=1 5=1 6=8192
BinaryOp                 258                      1 1 257 259 1=1
Convolution              260                      1 1 254 261 0=128 1=1 5=1 6=8192
BinaryOp                 262                      2 1 259 261 263
Convolution              264                      1 1 253 265 0=128 1=1 5=1 6=8192
BinaryOp                 266                      2 1 263 265 267
Convolution              268                      1 1 252 269 0=128 1=1 5=1 6=8192
BinaryOp                 270                      2 1 267 269 271
BinaryOp                 272                      1 1 271 273 0=2 1=1 2=1.768801e+00
BinaryOp                 274                      1 1 273 275 1=1 2=2.181246e-01
HardSwish                276                      1 1 275 277 0=1.666667e-01
BinaryOp                 278                      1 1 277 279 0=2 1=1 2=7.304567e-01
BinaryOp                 280                      1 1 279 281 1=1 2=-8.572540e-02
Split                    splitncnn_8              1 6 281 282 283 284 285 286 287
BatchNorm                288                      1 1 287 289 0=128
BinaryOp                 290                      1 1 289 291 1=1
ConvolutionDepthWise     292                      1 1 286 293 0=128 1=1 5=1 6=128 7=128
BinaryOp                 294                      2 1 291 293 295
ConvolutionDepthWise     296                      1 1 285 297 0=128 1=3 4=1 5=1 6=1152 7=128
BinaryOp                 298                      2 1 295 297 299
ConvolutionDepthWise     300                      1 1 284 301 0=128 1=3 4=1 5=1 6=1152 7=128
BinaryOp                 302                      2 1 299 301 303
ConvolutionDepthWise     304                      1 1 283 305 0=128 1=3 4=1 5=1 6=1152 7=128
BinaryOp                 306                      2 1 303 305 307
ConvolutionDepthWise     308                      1 1 282 309 0=128 1=3 4=1 5=1 6=1152 7=128
BinaryOp                 310                      2 1 307 309 311
BinaryOp                 312                      1 1 311 313 0=2 1=1 2=2.623634e+00
BinaryOp                 314                      1 1 313 315 1=1 2=-7.918281e-03
HardSwish                316                      1 1 315 317 0=1.666667e-01
BinaryOp                 318                      1 1 317 319 0=2 1=1 2=4.377005e-02
BinaryOp                 320                      1 1 319 321 1=1 2=5.633773e-05
Split                    splitncnn_9              1 5 321 322 323 324 325 326
BatchNorm                327                      1 1 326 328 0=128
BinaryOp                 329                      1 1 328 330 1=1
Convolution              331                      1 1 325 332 0=128 1=1 5=1 6=16384
BinaryOp                 333                      2 1 330 332 334
Convolution              335                      1 1 324 336 0=128 1=1 5=1 6=16384
BinaryOp                 337                      2 1 334 336 338
Convolution              339                      1 1 323 340 0=128 1=1 5=1 6=16384
BinaryOp                 341                      2 1 338 340 342
Convolution              343                      1 1 322 344 0=128 1=1 5=1 6=16384
BinaryOp                 345                      2 1 342 344 346
BinaryOp                 347                      1 1 346 348 0=2 1=1 2=1.893770e+00
BinaryOp                 349                      1 1 348 350 1=1 2=-4.865660e-02
HardSwish                351                      1 1 350 352 0=1.666667e-01
BinaryOp                 353                      1 1 352 354 0=2 1=1 2=6.528459e-01
BinaryOp                 355                      1 1 354 356 1=1 2=7.379292e-02
Split                    splitncnn_10             1 5 356 357 358 359 360 361
ConvolutionDepthWise     362                      1 1 361 363 0=128 1=1 3=2 13=1 5=1 6=128 7=128
BinaryOp                 364                      1 1 363 365 1=1
ConvolutionDepthWise     366                      1 1 360 367 0=128 1=3 3=2 13=1 4=1 5=1 6=1152 7=128
BinaryOp                 368                      2 1 365 367 369
ConvolutionDepthWise     370                      1 1 359 371 0=128 1=3 3=2 13=1 4=1 5=1 6=1152 7=128
BinaryOp                 372                      2 1 369 371 373
ConvolutionDepthWise     374                      1 1 358 375 0=128 1=3 3=2 13=1 4=1 5=1 6=1152 7=128
BinaryOp                 376                      2 1 373 375 377
ConvolutionDepthWise     378                      1 1 357 379 0=128 1=3 3=2 13=1 4=1 5=1 6=1152 7=128
BinaryOp                 380                      2 1 377 379 381
BinaryOp                 382                      1 1 381 383 0=2 1=1 2=2.482111e+00
BinaryOp                 384                      1 1 383 385 1=1 2=6.599923e-01
HardSwish                386                      1 1 385 387 0=1.666667e-01
BinaryOp                 388                      1 1 387 389 0=2 1=1 2=2.353299e-02
BinaryOp                 390                      1 1 389 391 1=1 2=5.462020e-05
Split                    splitncnn_11             1 4 391 392 393 394 395
Convolution              396                      1 1 395 397 0=240 1=1 5=1 6=30720
BinaryOp                 398                      1 1 397 399 1=1
Convolution              400                      1 1 394 401 0=240 1=1 5=1 6=30720
BinaryOp                 402                      2 1 399 401 403
Convolution              404                      1 1 393 405 0=240 1=1 5=1 6=30720
BinaryOp                 406                      2 1 403 405 407
Convolution              408                      1 1 392 409 0=240 1=1 5=1 6=30720
BinaryOp                 410                      2 1 407 409 411
BinaryOp                 412                      1 1 411 413 0=2 1=1 2=1.523635e+00
BinaryOp                 414                      1 1 413 415 1=1 2=6.392852e-02
HardSwish                416                      1 1 415 417 0=1.666667e-01
BinaryOp                 418                      1 1 417 419 0=2 1=1 2=5.249293e-01
BinaryOp                 420                      1 1 419 421 1=1 2=-1.167872e-02
Split                    splitncnn_12             1 6 421 422 423 424 425 426 427
BatchNorm                428                      1 1 427 429 0=240
BinaryOp                 430                      1 1 429 431 1=1
ConvolutionDepthWise     432                      1 1 426 433 0=240 1=1 5=1 6=240 7=240
BinaryOp                 434                      2 1 431 433 435
ConvolutionDepthWise     436                      1 1 425 437 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 438                      2 1 435 437 439
ConvolutionDepthWise     440                      1 1 424 441 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 442                      2 1 439 441 443
ConvolutionDepthWise     444                      1 1 423 445 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 446                      2 1 443 445 447
ConvolutionDepthWise     448                      1 1 422 449 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 450                      2 1 447 449 451
BinaryOp                 452                      1 1 451 453 0=2 1=1 2=2.138868e+00
BinaryOp                 454                      1 1 453 455 1=1 2=-4.507720e-01
HardSwish                456                      1 1 455 457 0=1.666667e-01
BinaryOp                 458                      1 1 457 459 0=2 1=1 2=1.181495e-01
BinaryOp                 460                      1 1 459 461 1=1 2=-6.013525e-05
Split                    splitncnn_13             1 5 461 462 463 464 465 466
BatchNorm                467                      1 1 466 468 0=240
BinaryOp                 469                      1 1 468 470 1=1
Convolution              471                      1 1 465 472 0=240 1=1 5=1 6=57600
BinaryOp                 473                      2 1 470 472 474
Convolution              475                      1 1 464 476 0=240 1=1 5=1 6=57600
BinaryOp                 477                      2 1 474 476 478
Convolution              479                      1 1 463 480 0=240 1=1 5=1 6=57600
BinaryOp                 481                      2 1 478 480 482
Convolution              483                      1 1 462 484 0=240 1=1 5=1 6=57600
BinaryOp                 485                      2 1 482 484 486
BinaryOp                 487                      1 1 486 488 0=2 1=1 2=2.044553e+00
BinaryOp                 489                      1 1 488 490 1=1 2=-2.431049e-01
HardSwish                491                      1 1 490 492 0=1.666667e-01
BinaryOp                 493                      1 1 492 494 0=2 1=1 2=6.219931e-01
BinaryOp                 495                      1 1 494 496 1=1 2=8.859989e-02
Split                    splitncnn_14             1 6 496 497 498 499 500 501 502
BatchNorm                503                      1 1 502 504 0=240
BinaryOp                 505                      1 1 504 506 1=1
ConvolutionDepthWise     507                      1 1 501 508 0=240 1=1 5=1 6=240 7=240
BinaryOp                 509                      2 1 506 508 510
ConvolutionDepthWise     511                      1 1 500 512 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 513                      2 1 510 512 514
ConvolutionDepthWise     515                      1 1 499 516 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 517                      2 1 514 516 518
ConvolutionDepthWise     519                      1 1 498 520 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 521                      2 1 518 520 522
ConvolutionDepthWise     523                      1 1 497 524 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 525                      2 1 522 524 526
BinaryOp                 527                      1 1 526 528 0=2 1=1 2=2.830977e+00
BinaryOp                 529                      1 1 528 530 1=1 2=1.021500e-01
HardSwish                531                      1 1 530 532 0=1.666667e-01
BinaryOp                 533                      1 1 532 534 0=2 1=1 2=4.216631e-02
BinaryOp                 535                      1 1 534 536 1=1 2=-5.604238e-05
Split                    splitncnn_15             1 5 536 537 538 539 540 541
BatchNorm                542                      1 1 541 543 0=240
BinaryOp                 544                      1 1 543 545 1=1
Convolution              546                      1 1 540 547 0=240 1=1 5=1 6=57600
BinaryOp                 548                      2 1 545 547 549
Convolution              550                      1 1 539 551 0=240 1=1 5=1 6=57600
BinaryOp                 552                      2 1 549 551 553
Convolution              554                      1 1 538 555 0=240 1=1 5=1 6=57600
BinaryOp                 556                      2 1 553 555 557
Convolution              558                      1 1 537 559 0=240 1=1 5=1 6=57600
BinaryOp                 560                      2 1 557 559 561
BinaryOp                 562                      1 1 561 563 0=2 1=1 2=2.156336e+00
BinaryOp                 564                      1 1 563 565 1=1 2=-5.589596e-01
HardSwish                566                      1 1 565 567 0=1.666667e-01
BinaryOp                 568                      1 1 567 569 0=2 1=1 2=5.327490e-01
BinaryOp                 570                      1 1 569 571 1=1 2=1.568191e-01
Split                    splitncnn_16             1 6 571 572 573 574 575 576 577
BatchNorm                578                      1 1 577 579 0=240
BinaryOp                 580                      1 1 579 581 1=1
ConvolutionDepthWise     582                      1 1 576 583 0=240 1=1 5=1 6=240 7=240
BinaryOp                 584                      2 1 581 583 585
ConvolutionDepthWise     586                      1 1 575 587 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 588                      2 1 585 587 589
ConvolutionDepthWise     590                      1 1 574 591 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 592                      2 1 589 591 593
ConvolutionDepthWise     594                      1 1 573 595 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 596                      2 1 593 595 597
ConvolutionDepthWise     598                      1 1 572 599 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 600                      2 1 597 599 601
BinaryOp                 602                      1 1 601 603 0=2 1=1 2=2.506705e+00
BinaryOp                 604                      1 1 603 605 1=1 2=1.157011e+00
HardSwish                606                      1 1 605 607 0=1.666667e-01
BinaryOp                 608                      1 1 607 609 0=2 1=1 2=4.520729e-02
BinaryOp                 610                      1 1 609 611 1=1 2=-3.584615e-06
Split                    splitncnn_17             1 5 611 612 613 614 615 616
BatchNorm                617                      1 1 616 618 0=240
BinaryOp                 619                      1 1 618 620 1=1
Convolution              621                      1 1 615 622 0=240 1=1 5=1 6=57600
BinaryOp                 623                      2 1 620 622 624
Convolution              625                      1 1 614 626 0=240 1=1 5=1 6=57600
BinaryOp                 627                      2 1 624 626 628
Convolution              629                      1 1 613 630 0=240 1=1 5=1 6=57600
BinaryOp                 631                      2 1 628 630 632
Convolution              633                      1 1 612 634 0=240 1=1 5=1 6=57600
BinaryOp                 635                      2 1 632 634 636
BinaryOp                 637                      1 1 636 638 0=2 1=1 2=2.150808e+00
BinaryOp                 639                      1 1 638 640 1=1 2=-5.547040e-01
HardSwish                641                      1 1 640 642 0=1.666667e-01
BinaryOp                 643                      1 1 642 644 0=2 1=1 2=5.370421e-01
BinaryOp                 645                      1 1 644 646 1=1 2=1.735165e-01
Split                    splitncnn_18             1 6 646 647 648 649 650 651 652
BatchNorm                653                      1 1 652 654 0=240
BinaryOp                 655                      1 1 654 656 1=1
ConvolutionDepthWise     657                      1 1 651 658 0=240 1=1 5=1 6=240 7=240
BinaryOp                 659                      2 1 656 658 660
ConvolutionDepthWise     661                      1 1 650 662 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 663                      2 1 660 662 664
ConvolutionDepthWise     665                      1 1 649 666 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 667                      2 1 664 666 668
ConvolutionDepthWise     669                      1 1 648 670 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 671                      2 1 668 670 672
ConvolutionDepthWise     673                      1 1 647 674 0=240 1=5 4=2 5=1 6=6000 7=240
BinaryOp                 675                      2 1 672 674 676
BinaryOp                 677                      1 1 676 678 0=2 1=1 2=2.481236e+00
BinaryOp                 679                      1 1 678 680 1=1 2=1.145820e+00
HardSwish                681                      1 1 680 682 0=1.666667e-01
BinaryOp                 683                      1 1 682 684 0=2 1=1 2=5.446845e-02
BinaryOp                 685                      1 1 684 686 1=1 2=4.943241e-05
Split                    splitncnn_19             1 5 686 687 688 689 690 691
BatchNorm                692                      1 1 691 693 0=240
BinaryOp                 694                      1 1 693 695 1=1
Convolution              696                      1 1 690 697 0=240 1=1 5=1 6=57600
BinaryOp                 698                      2 1 695 697 699
Convolution              700                      1 1 689 701 0=240 1=1 5=1 6=57600
BinaryOp                 702                      2 1 699 701 703
Convolution              704                      1 1 688 705 0=240 1=1 5=1 6=57600
BinaryOp                 706                      2 1 703 705 707
Convolution              708                      1 1 687 709 0=240 1=1 5=1 6=57600
BinaryOp                 710                      2 1 707 709 711
BinaryOp                 712                      1 1 711 713 0=2 1=1 2=2.169699e+00
BinaryOp                 714                      1 1 713 715 1=1 2=-6.480080e-01
HardSwish                716                      1 1 715 717 0=1.666667e-01
BinaryOp                 718                      1 1 717 719 0=2 1=1 2=7.006389e-01
BinaryOp                 720                      1 1 719 721 1=1 2=2.380483e-01
Split                    splitncnn_20             1 5 721 722 723 724 725 726
ConvolutionDepthWise     727                      1 1 726 728 0=240 1=1 13=2 5=1 6=240 7=240
BinaryOp                 729                      1 1 728 730 1=1
ConvolutionDepthWise     731                      1 1 725 732 0=240 1=5 13=2 4=2 5=1 6=6000 7=240
BinaryOp                 733                      2 1 730 732 734
ConvolutionDepthWise     735                      1 1 724 736 0=240 1=5 13=2 4=2 5=1 6=6000 7=240
BinaryOp                 737                      2 1 734 736 738
ConvolutionDepthWise     739                      1 1 723 740 0=240 1=5 13=2 4=2 5=1 6=6000 7=240
BinaryOp                 741                      2 1 738 740 742
ConvolutionDepthWise     743                      1 1 722 744 0=240 1=5 13=2 4=2 5=1 6=6000 7=240
BinaryOp                 745                      2 1 742 744 746
BinaryOp                 747                      1 1 746 748 0=2 1=1 2=1.926186e+00
BinaryOp                 749                      1 1 748 750 1=1 2=4.542438e-01
HardSwish                751                      1 1 750 752 0=1.666667e-01
BinaryOp                 753                      1 1 752 754 0=2 1=1 2=1.393038e+00
BinaryOp                 755                      1 1 754 756 1=1 2=-4.136366e-01
Split                    splitncnn_21             1 2 756 757 758
Pooling                  759                      1 1 758 760 0=1 4=1
InnerProduct             761                      1 1 760 762 0=60 1=1 2=14400 9=1
InnerProduct             763                      1 1 762 764 0=240 1=1 2=14400
HardSigmoid              765                      1 1 764 766 0=1.666667e-01
BinaryOp                 767                      2 1 757 766 768 0=2
Split                    splitncnn_22             1 4 768 769 770 771 772
Convolution              773                      1 1 772 774 0=480 1=1 5=1 6=115200
BinaryOp                 775                      1 1 774 776 1=1
Convolution              777                      1 1 771 778 0=480 1=1 5=1 6=115200
BinaryOp                 779                      2 1 776 778 780
Convolution              781                      1 1 770 782 0=480 1=1 5=1 6=115200
BinaryOp                 783                      2 1 780 782 784
Convolution              785                      1 1 769 786 0=480 1=1 5=1 6=115200
BinaryOp                 787                      2 1 784 786 788
BinaryOp                 789                      1 1 788 790 0=2 1=1 2=2.592662e+00
BinaryOp                 791                      1 1 790 792 1=1 2=-4.306299e-01
HardSwish                793                      1 1 792 794 0=1.666667e-01
BinaryOp                 795                      1 1 794 796 0=2 1=1 2=9.122257e-01
BinaryOp                 797                      1 1 796 798 1=1 2=2.021912e-01
Split                    splitncnn_23             1 6 798 799 800 801 802 803 804
BatchNorm                805                      1 1 804 806 0=480
BinaryOp                 807                      1 1 806 808 1=1
ConvolutionDepthWise     809                      1 1 803 810 0=480 1=1 5=1 6=480 7=480
BinaryOp                 811                      2 1 808 810 812
ConvolutionDepthWise     813                      1 1 802 814 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 815                      2 1 812 814 816
ConvolutionDepthWise     817                      1 1 801 818 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 819                      2 1 816 818 820
ConvolutionDepthWise     821                      1 1 800 822 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 823                      2 1 820 822 824
ConvolutionDepthWise     825                      1 1 799 826 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 827                      2 1 824 826 828
BinaryOp                 829                      1 1 828 830 0=2 1=1 2=2.179476e+00
BinaryOp                 831                      1 1 830 832 1=1 2=2.459434e-01
HardSwish                833                      1 1 832 834 0=1.666667e-01
BinaryOp                 835                      1 1 834 836 0=2 1=1 2=1.983662e+00
BinaryOp                 837                      1 1 836 838 1=1 2=-7.467775e-01
Split                    splitncnn_24             1 2 838 839 840
Pooling                  841                      1 1 840 842 0=1 4=1
InnerProduct             843                      1 1 842 844 0=120 1=1 2=57600 9=1
InnerProduct             845                      1 1 844 846 0=480 1=1 2=57600
HardSigmoid              847                      1 1 846 848 0=1.666667e-01
BinaryOp                 849                      2 1 839 848 850 0=2
Split                    splitncnn_25             1 5 850 851 852 853 854 855
BatchNorm                856                      1 1 855 857 0=480
BinaryOp                 858                      1 1 857 859 1=1
Convolution              860                      1 1 854 861 0=480 1=1 5=1 6=230400
BinaryOp                 862                      2 1 859 861 863
Convolution              864                      1 1 853 865 0=480 1=1 5=1 6=230400
BinaryOp                 866                      2 1 863 865 867
Convolution              868                      1 1 852 869 0=480 1=1 5=1 6=230400
BinaryOp                 870                      2 1 867 869 871
Convolution              872                      1 1 851 873 0=480 1=1 5=1 6=230400
BinaryOp                 874                      2 1 871 873 875
BinaryOp                 876                      1 1 875 877 0=2 1=1 2=2.586924e+00
BinaryOp                 878                      1 1 877 879 1=1 2=-8.015537e-01
HardSwish                880                      1 1 879 881 0=1.666667e-01
BinaryOp                 882                      1 1 881 883 0=2 1=1 2=6.589833e-01
BinaryOp                 884                      1 1 883 885 1=1 2=2.119369e-01
Split                    splitncnn_26             1 5 885 886 887 888 889 890
ConvolutionDepthWise     891                      1 1 890 892 0=480 1=1 13=2 5=1 6=480 7=480
BinaryOp                 893                      1 1 892 894 1=1
ConvolutionDepthWise     895                      1 1 889 896 0=480 1=5 13=2 4=2 5=1 6=12000 7=480
BinaryOp                 897                      2 1 894 896 898
ConvolutionDepthWise     899                      1 1 888 900 0=480 1=5 13=2 4=2 5=1 6=12000 7=480
BinaryOp                 901                      2 1 898 900 902
ConvolutionDepthWise     903                      1 1 887 904 0=480 1=5 13=2 4=2 5=1 6=12000 7=480
BinaryOp                 905                      2 1 902 904 906
ConvolutionDepthWise     907                      1 1 886 908 0=480 1=5 13=2 4=2 5=1 6=12000 7=480
BinaryOp                 909                      2 1 906 908 910
BinaryOp                 911                      1 1 910 912 0=2 1=1 2=2.348032e+00
BinaryOp                 913                      1 1 912 914 1=1 2=1.665339e+00
HardSwish                915                      1 1 914 916 0=1.666667e-01
BinaryOp                 917                      1 1 916 918 0=2 1=1 2=7.098751e-02
BinaryOp                 919                      1 1 918 920 1=1 2=2.780899e-04
Split                    splitncnn_27             1 5 920 921 922 923 924 925
BatchNorm                926                      1 1 925 927 0=480
BinaryOp                 928                      1 1 927 929 1=1
Convolution              930                      1 1 924 931 0=480 1=1 5=1 6=230400
BinaryOp                 932                      2 1 929 931 933
Convolution              934                      1 1 923 935 0=480 1=1 5=1 6=230400
BinaryOp                 936                      2 1 933 935 937
Convolution              938                      1 1 922 939 0=480 1=1 5=1 6=230400
BinaryOp                 940                      2 1 937 939 941
Convolution              942                      1 1 921 943 0=480 1=1 5=1 6=230400
BinaryOp                 944                      2 1 941 943 945
BinaryOp                 946                      1 1 945 947 0=2 1=1 2=3.173168e+00
BinaryOp                 948                      1 1 947 949 1=1 2=-6.365986e-01
HardSwish                950                      1 1 949 951 0=1.666667e-01
BinaryOp                 952                      1 1 951 953 0=2 1=1 2=4.656531e-01
BinaryOp                 954                      1 1 953 955 1=1 2=1.285813e-01
Split                    splitncnn_28             1 6 955 956 957 958 959 960 961
BatchNorm                962                      1 1 961 963 0=480
BinaryOp                 964                      1 1 963 965 1=1
ConvolutionDepthWise     966                      1 1 960 967 0=480 1=1 5=1 6=480 7=480
BinaryOp                 968                      2 1 965 967 969
ConvolutionDepthWise     970                      1 1 959 971 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 972                      2 1 969 971 973
ConvolutionDepthWise     974                      1 1 958 975 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 976                      2 1 973 975 977
ConvolutionDepthWise     978                      1 1 957 979 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 980                      2 1 977 979 981
ConvolutionDepthWise     982                      1 1 956 983 0=480 1=5 4=2 5=1 6=12000 7=480
BinaryOp                 984                      2 1 981 983 985
BinaryOp                 986                      1 1 985 987 0=2 1=1 2=2.981040e+00
BinaryOp                 988                      1 1 987 989 1=1 2=1.155505e-01
HardSwish                990                      1 1 989 991 0=1.666667e-01
BinaryOp                 992                      1 1 991 993 0=2 1=1 2=3.976384e-01
BinaryOp                 994                      1 1 993 995 1=1 2=2.775773e-05
Split                    splitncnn_29             1 5 995 996 997 998 999 1000
BatchNorm                1001                     1 1 1000 1002 0=480
BinaryOp                 1003                     1 1 1002 1004 1=1
Convolution              1005                     1 1 999 1006 0=480 1=1 5=1 6=230400
BinaryOp                 1007                     2 1 1004 1006 1008
Convolution              1009                     1 1 998 1010 0=480 1=1 5=1 6=230400
BinaryOp                 1011                     2 1 1008 1010 1012
Convolution              1013                     1 1 997 1014 0=480 1=1 5=1 6=230400
BinaryOp                 1015                     2 1 1012 1014 1016
Convolution              1017                     1 1 996 1018 0=480 1=1 5=1 6=230400
BinaryOp                 1019                     2 1 1016 1018 1020
BinaryOp                 1021                     1 1 1020 1022 0=2 1=1 2=3.725856e+00
BinaryOp                 1023                     1 1 1022 1024 1=1 2=-3.639896e-01
HardSwish                1025                     1 1 1024 1026 0=1.666667e-01
BinaryOp                 1027                     1 1 1026 1028 0=2 1=1 2=3.348482e+00
BinaryOp                 1029                     1 1 1028 1030 1=1 2=-7.174185e-02
Pooling                  1031                     1 1 1030 1032 0=1 1=2 11=3 2=2 12=3 5=1
Split                    splitncnn_30             1 2 1032 1033 1034
Convolution              1035                     1 1 1034 1036 0=60 1=3 11=1 4=1 14=0 5=1 6=86400
Swish                    1037                     1 1 1036 1038
Convolution              1039                     1 1 1038 1040 0=120 1=1 5=1 6=7200
Swish                    1041                     1 1 1040 1042
Reshape                  1043                     1 1 1042 1044 0=-1 1=120
Permute                  1045                     1 1 1044 1046 0=1
Split                    splitncnn_31             1 2 1046 1047 1048
LayerNorm                1049                     1 1 1048 1050 0=120 1=1.000000e-05
Split                    splitncnn_32             1 3 1050 1051 1052 1053
MultiHeadAttention       1054                     3 1 1053 1052 1051 1055 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 1056                     2 1 1047 1055 1057
Split                    splitncnn_33             1 2 1057 1058 1059
LayerNorm                1060                     1 1 1059 1061 0=120 1=1.000000e-05
InnerProduct             1062                     1 1 1061 1063 0=240 1=1 2=28800
Swish                    1064                     1 1 1063 1065
InnerProduct             1066                     1 1 1065 1067 0=120 1=1 2=28800
BinaryOp                 1068                     2 1 1058 1067 1069
Split                    splitncnn_34             1 2 1069 1070 1071
LayerNorm                1072                     1 1 1071 1073 0=120 1=1.000000e-05
Split                    splitncnn_35             1 3 1073 1074 1075 1076
MultiHeadAttention       1077                     3 1 1076 1075 1074 1078 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 1079                     2 1 1070 1078 1080
Split                    splitncnn_36             1 2 1080 1081 1082
LayerNorm                1083                     1 1 1082 1084 0=120 1=1.000000e-05
InnerProduct             1085                     1 1 1084 1086 0=240 1=1 2=28800
Swish                    1087                     1 1 1086 1088
InnerProduct             1089                     1 1 1088 1090 0=120 1=1 2=28800
BinaryOp                 1091                     2 1 1081 1090 1092
LayerNorm                1093                     1 1 1092 1094 0=120 1=1.000000e-06
Reshape                  1095                     1 1 1094 1096 0=120 1=-1 2=1
Permute                  1097                     1 1 1096 1098 0=4
Convolution              1099                     1 1 1098 1100 0=480 1=1 5=1 6=57600
Swish                    1101                     1 1 1100 1102
Concat                   1103                     2 1 1033 1102 1104
Convolution              1105                     1 1 1104 1106 0=60 1=3 4=1 5=1 6=518400
Swish                    1107                     1 1 1106 1108
Convolution              1109                     1 1 1108 1110 0=120 1=1 5=1 6=7200
Swish                    1111                     1 1 1110 1112
Reshape                  1113                     1 1 1112 1114 0=-1 1=120
Permute                  1115                     1 1 1114 1116 0=1
InnerProduct             1117                     1 1 1116 1118 0=6625 1=1 2=795000
Softmax                  1119                     1 1 1118 out0 0=1 1=1